Revit 2027 API
ElementRecord.GetCategoryId Method
 Gets the category id of the element record.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetCategoryId()
Public Function GetCategoryId As ElementId
public:
ElementId^ GetCategoryId()
member GetCategoryId : unit -> ElementId
Return Value
ElementId
 The category id.
See Also
Reference
ElementRecord Class
Autodesk.Revit.DB Namespace